devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
/*=========================================================================*//**
@file    spi.c

@author  Daniel Zorychta

@brief   SPI driver

@note    Copyright (C) 2013 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "core/module.h"
#include "stm32f1/spi_cfg.h"
#include "stm32f1/spi_def.h"
#include "stm32f1/stm32f10x.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define MUTEX_TIMOUT             MAX_DELAY_MS
#define SEMAPHORE_TIMEOUT        MAX_DELAY_MS

/*==============================================================================
  Local object types
==============================================================================*/
MODULE_NAME(SPI);

/* configuration of single CS line (port and pin) */
struct cs_pin_cfg {
        GPIO_t *const            port;
        u16_t                    pin_mask;
};

/* SPI peripheral configuration */
struct spi_config {
        SPI_t                   *SPI;
        __IO u32_t              *APBRSTR;
        __IO u32_t              *APBENR;
        u32_t                    APBRSTRENR_mask;
        IRQn_Type                IRQn;
        u32_t                    IRQ_priority;
        DMA_t                   *DMA;
    #if  (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0) || (_SPI3_USE_DMA > 0)
        DMA_Channel_t           *DMA_Tx_channel;
        DMA_Channel_t           *DMA_Rx_channel;
        u8_t                     DMA_Rx_channel_number;
        IRQn_Type                DMA_Rx_IRQn;
        u32_t                    DMA_enable_mask;
    #endif
        u8_t                     number_of_slaves;
        const struct cs_pin_cfg *CS;
};

/* independent SPI instance */
struct spi_virtual {
        dev_lock_t               file_lock;
        u8_t                     major;
        u8_t                     minor;
        struct SPI_config        config;
};

/* general module data */
struct module {
        sem_t                   *wait_irq_sem[_NUMBER_OF_SPI_PERIPHERALS];
        mutex_t                 *device_protect_mtx[_NUMBER_OF_SPI_PERIPHERALS];
        const u8_t              *tx_buffer[_NUMBER_OF_SPI_PERIPHERALS];
        u8_t                    *rx_buffer[_NUMBER_OF_SPI_PERIPHERALS];
        size_t                   count[_NUMBER_OF_SPI_PERIPHERALS];
        bool                     RAW[_NUMBER_OF_SPI_PERIPHERALS];
        u8_t                     dummy_byte[_NUMBER_OF_SPI_PERIPHERALS];
        u8_t                     number_of_virtual_spi[_NUMBER_OF_SPI_PERIPHERALS];
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static bool     turn_on_SPI          (u8_t major);
static void     turn_off_SPI         (u8_t major);
static void     apply_SPI_config     (struct spi_virtual *vspi);
static void     apply_SPI_safe_config(u8_t major);
static void     select_slave         (u8_t major, u8_t minor);
static void     deselect_slave       (u8_t major);
static bool     transceive           (struct spi_virtual *hdl, const u8_t *tx, u8_t *rx, size_t count);

/*==============================================================================
  Local objects
==============================================================================*/
/* SPI1 CS slaves configuration */
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
static const struct cs_pin_cfg SPI1_CS_cfg[_SPI1_NUMBER_OF_SLAVES] = {
        #if (_SPI1_NUMBER_OF_SLAVES >= 1)
        {.port = (GPIO_t *)_SPI1_CS0_PORT, .pin_mask = _SPI1_CS0_PIN_BM},
        #endif
        #if (_SPI1_NUMBER_OF_SLAVES >= 2)
        {.port = (GPIO_t *)_SPI1_CS1_PORT, .pin_mask = _SPI1_CS1_PIN_BM},
        #endif
        #if (_SPI1_NUMBER_OF_SLAVES >= 3)
        {.port = (GPIO_t *)_SPI1_CS2_PORT, .pin_mask = _SPI1_CS2_PIN_BM},
        #endif
        #if (_SPI1_NUMBER_OF_SLAVES >= 4)
        {.port = (GPIO_t *)_SPI1_CS3_PORT, .pin_mask = _SPI1_CS3_PIN_BM},
        #endif
        #if (_SPI1_NUMBER_OF_SLAVES >= 5)
        {.port = (GPIO_t *)_SPI1_CS4_PORT, .pin_mask = _SPI1_CS4_PIN_BM},
        #endif
        #if (_SPI1_NUMBER_OF_SLAVES >= 6)
        {.port = (GPIO_t *)_SPI1_CS5_PORT, .pin_mask = _SPI1_CS5_PIN_BM},
        #endif
        #if (_SPI1_NUMBER_OF_SLAVES >= 7)
        {.port = (GPIO_t *)_SPI1_CS6_PORT, .pin_mask = _SPI1_CS6_PIN_BM},
        #endif
        #if (_SPI1_NUMBER_OF_SLAVES >= 8)
        {.port = (GPIO_t *)_SPI1_CS7_PORT, .pin_mask = _SPI1_CS7_PIN_BM}
        #endif
};
#endif

/* SPI2 CS slaves configuration */
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
static const struct cs_pin_cfg SPI2_CS_cfg[_SPI2_NUMBER_OF_SLAVES] = {
        #if (_SPI2_NUMBER_OF_SLAVES >= 1)
        {.port = (GPIO_t *)_SPI2_CS0_PORT, .pin_mask = _SPI2_CS0_PIN_BM},
        #endif
        #if (_SPI2_NUMBER_OF_SLAVES >= 2)
        {.port = (GPIO_t *)_SPI2_CS1_PORT, .pin_mask = _SPI2_CS1_PIN_BM},
        #endif
        #if (_SPI2_NUMBER_OF_SLAVES >= 3)
        {.port = (GPIO_t *)_SPI2_CS2_PORT, .pin_mask = _SPI2_CS2_PIN_BM},
        #endif
        #if (_SPI2_NUMBER_OF_SLAVES >= 4)
        {.port = (GPIO_t *)_SPI2_CS3_PORT, .pin_mask = _SPI2_CS3_PIN_BM},
        #endif
        #if (_SPI2_NUMBER_OF_SLAVES >= 5)
        {.port = (GPIO_t *)_SPI2_CS4_PORT, .pin_mask = _SPI2_CS4_PIN_BM},
        #endif
        #if (_SPI2_NUMBER_OF_SLAVES >= 6)
        {.port = (GPIO_t *)_SPI2_CS5_PORT, .pin_mask = _SPI2_CS5_PIN_BM},
        #endif
        #if (_SPI2_NUMBER_OF_SLAVES >= 7)
        {.port = (GPIO_t *)_SPI2_CS6_PORT, .pin_mask = _SPI2_CS6_PIN_BM},
        #endif
        #if (_SPI2_NUMBER_OF_SLAVES >= 8)
        {.port = (GPIO_t *)_SPI2_CS7_PORT, .pin_mask = _SPI2_CS7_PIN_BM}
        #endif
};
#endif

/* SPI3 CS slaves configuration */
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
static const struct cs_pin_cfg SPI3_CS_cfg[_SPI3_NUMBER_OF_SLAVES] = {
        #if (_SPI3_NUMBER_OF_SLAVES >= 1)
        {.port = (GPIO_t *)_SPI3_CS0_PORT, .pin_mask = _SPI3_CS0_PIN_BM},
        #endif
        #if (_SPI3_NUMBER_OF_SLAVES >= 2)
        {.port = (GPIO_t *)_SPI3_CS1_PORT, .pin_mask = _SPI3_CS1_PIN_BM},
        #endif
        #if (_SPI3_NUMBER_OF_SLAVES >= 3)
        {.port = (GPIO_t *)_SPI3_CS2_PORT, .pin_mask = _SPI3_CS2_PIN_BM},
        #endif
        #if (_SPI3_NUMBER_OF_SLAVES >= 4)
        {.port = (GPIO_t *)_SPI3_CS3_PORT, .pin_mask = _SPI3_CS3_PIN_BM},
        #endif
        #if (_SPI3_NUMBER_OF_SLAVES >= 5)
        {.port = (GPIO_t *)_SPI3_CS4_PORT, .pin_mask = _SPI3_CS4_PIN_BM},
        #endif
        #if (_SPI3_NUMBER_OF_SLAVES >= 6)
        {.port = (GPIO_t *)_SPI3_CS5_PORT, .pin_mask = _SPI3_CS5_PIN_BM},
        #endif
        #if (_SPI3_NUMBER_OF_SLAVES >= 7)
        {.port = (GPIO_t *)_SPI3_CS6_PORT, .pin_mask = _SPI3_CS6_PIN_BM},
        #endif
        #if (_SPI3_NUMBER_OF_SLAVES >= 8)
        {.port = (GPIO_t *)_SPI3_CS7_PORT, .pin_mask = _SPI3_CS7_PIN_BM}
        #endif
};
#endif


/* SPI peripherals basic parameters */
static const struct spi_config SPI_cfg[_NUMBER_OF_SPI_PERIPHERALS] = {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        {
                .APBENR                = &RCC->APB2ENR,
                .APBRSTR               = &RCC->APB2RSTR,
                .APBRSTRENR_mask       = RCC_APB2ENR_SPI1EN,
                .IRQn                  = SPI1_IRQn,
                .IRQ_priority          = _SPI1_IRQ_PRIORITY,
                .SPI                   = SPI1,
                .DMA                   = _SPI1_USE_DMA ? DMA1 : NULL,
                #if  (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0) || (_SPI3_USE_DMA > 0)
                .DMA_Tx_channel        = DMA1_Channel3,
                .DMA_Rx_channel        = DMA1_Channel2,
                .DMA_Rx_IRQn           = DMA1_Channel2_IRQn,
                .DMA_Rx_channel_number = 2,
                .DMA_enable_mask       = RCC_AHBENR_DMA1EN,
                #endif
                .number_of_slaves      = _SPI1_NUMBER_OF_SLAVES,
                .CS                    = SPI1_CS_cfg
        },
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        {
                .APBENR                = &RCC->APB1ENR,
                .APBRSTR               = &RCC->APB1RSTR,
                .APBRSTRENR_mask       = RCC_APB1ENR_SPI2EN,
                .IRQn                  = SPI2_IRQn,
                .IRQ_priority          = _SPI2_IRQ_PRIORITY,
                .SPI                   = SPI2,
                .DMA                   = _SPI2_USE_DMA ? DMA1 : NULL,
                #if  (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0) || (_SPI3_USE_DMA > 0)
                .DMA_Tx_channel        = DMA1_Channel5,
                .DMA_Rx_channel        = DMA1_Channel4,
                .DMA_Rx_IRQn           = DMA1_Channel4_IRQn,
                .DMA_Rx_channel_number = 4,
                .DMA_enable_mask       = RCC_AHBENR_DMA1EN,
                #endif
                .number_of_slaves      = _SPI2_NUMBER_OF_SLAVES,
                .CS                    = SPI2_CS_cfg
        },
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        {
                .APBENR                = &RCC->APB1ENR,
                .APBRSTR               = &RCC->APB1RSTR,
                .APBRSTRENR_mask       = RCC_APB1ENR_SPI3EN,
                .IRQn                  = SPI3_IRQn,
                .IRQ_priority          = _SPI3_IRQ_PRIORITY,
                .SPI                   = SPI3,
                .DMA                   = _SPI3_USE_DMA ? DMA2 : NULL,
                #if  (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0) || (_SPI3_USE_DMA > 0)
                .DMA_Tx_channel        = DMA2_Channel2,
                .DMA_Rx_channel        = DMA2_Channel1,
                .DMA_Rx_IRQn           = DMA2_Channel1_IRQn,
                .DMA_Rx_channel_number = 1,
                .DMA_enable_mask       = RCC_AHBENR_DMA2EN,
                #endif
                .number_of_slaves      = _SPI3_NUMBER_OF_SLAVES,
                .CS                    = SPI3_CS_cfg
        }
        #endif
};

/* default SPI config */
static const struct SPI_config spi_default_cfg = {
        .dummy_byte  = _SPI_DEFAULT_CFG_DUMMY_BYTE,
        .clk_divider = _SPI_DEFAULT_CFG_CLK_DIVIDER,
        .mode        = _SPI_DEFAULT_CFG_MODE,
        .msb_first   = _SPI_DEFAULT_CFG_MSB_FIRST
};

/* pointers to memory of specified device */
static struct module *SPIM;

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(SPI, void **device_handle, u8_t major, u8_t minor)
{
        if (major >= _NUMBER_OF_SPI_PERIPHERALS) {
                return ENXIO;
        }

#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        if (major == _SPI1 && minor >= _SPI1_NUMBER_OF_SLAVES) {
                return ENXIO;
        }
#endif

#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        if (major == _SPI2 && minor >= _SPI2_NUMBER_OF_SLAVES) {
                return ENXIO;
        }
#endif

#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        if (major == _SPI3 && minor >= _SPI3_NUMBER_OF_SLAVES) {
                return ENXIO;
        }
#endif

        /* allocate module general data if initialized first time */
        if (!SPIM) {
                SPIM = calloc(1, sizeof(struct module));
                if (!SPIM) {
                        return ENOMEM;
                }
        }

        /* create irq semaphore */
        if (!SPIM->wait_irq_sem[major]) {
                SPIM->wait_irq_sem[major] = _sys_semaphore_new(1, 0);
                if (!SPIM->wait_irq_sem[major]) {
                        return ENOMEM;
                }
        }

        /* create protection mutex and start device if initialized first time */
        if (!SPIM->device_protect_mtx[major]) {
                SPIM->device_protect_mtx[major] = _sys_mutex_new(MUTEX_RECURSIVE);
                if (!SPIM->device_protect_mtx[major]) {
                        _sys_semaphore_delete(SPIM->wait_irq_sem[major]);
                        SPIM->wait_irq_sem[major] = NULL;
                        return ENOMEM;
                } else {
                        if (turn_on_SPI(major) == true) {
                                if (SPI_cfg[major].DMA) {
                                        #if  (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0) || (_SPI3_USE_DMA > 0)
                                        RCC->AHBENR |= SPI_cfg[major].DMA_enable_mask;

                                        u32_t DMA_IRQ_mask = (DMA_ISR_GIF1 | DMA_ISR_TCIF1 | DMA_ISR_TEIF1);
                                        u8_t  ch_position  = (SPI_cfg[major].DMA_Rx_channel_number - 1) * 4;
                                        SPI_cfg[major].DMA->IFCR = (DMA_IRQ_mask << ch_position);
                                        SPI_cfg[major].DMA->ISR |= (DMA_IRQ_mask << ch_position);

                                        NVIC_EnableIRQ(SPI_cfg[major].DMA_Rx_IRQn);
                                        NVIC_SetPriority(SPI_cfg[major].DMA_Rx_IRQn, SPI_cfg[major].IRQ_priority);
                                        #endif
                                } else {
                                        #if (_SPI1_USE_DMA == 0 && _SPI1_ENABLE) || (_SPI2_USE_DMA == 0 && _SPI2_ENABLE) || (_SPI3_USE_DMA == 0 && _SPI3_ENABLE)
                                        NVIC_EnableIRQ(SPI_cfg[major].IRQn);
                                        NVIC_SetPriority(SPI_cfg[major].IRQn, SPI_cfg[major].IRQ_priority);
                                        #endif
                                }

                        } else {
                                _sys_semaphore_delete(SPIM->wait_irq_sem[major]);
                                SPIM->wait_irq_sem[major] = NULL;
                                _sys_mutex_delete(SPIM->device_protect_mtx[major]);
                                SPIM->device_protect_mtx[major] = NULL;
                                return EADDRINUSE;
                        }
                }
        }

        /* create new instance for specified major-minor number (virtual spi) */
        struct spi_virtual *hdl = calloc(1, sizeof(struct spi_virtual));
        if (hdl) {
                hdl->config    = spi_default_cfg;
                hdl->major     = major;
                hdl->minor     = minor;
                *device_handle = hdl;

                SPIM->number_of_virtual_spi[major]++;
        } else {
                return ENOMEM;
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(SPI, void *device_handle)
{
        struct spi_virtual *hdl = device_handle;

