devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        if (_sys_device_is_unlocked(hdl->file_lock)) {

                _sys_critical_section_begin();

                SPIM->number_of_virtual_spi[hdl->major]--;

                /* deinitialize major device if all minor devices are deinitialized */
                if (SPIM->number_of_virtual_spi[hdl->major] == 0) {
                        _sys_mutex_delete(SPIM->device_protect_mtx[hdl->major]);
                        SPIM->device_protect_mtx[hdl->major] = NULL;
                        _sys_semaphore_delete(SPIM->wait_irq_sem[hdl->major]);
                        SPIM->wait_irq_sem[hdl->major] = NULL;
                        turn_off_SPI(hdl->major);

                        if (SPI_cfg[hdl->major].DMA) {
                                #if  (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0) || (_SPI3_USE_DMA > 0)
                                NVIC_DisableIRQ(SPI_cfg[hdl->major].DMA_Rx_IRQn);
                                #endif
                        } else {
                                #if (_SPI1_USE_DMA == 0 && _SPI1_ENABLE) || (_SPI2_USE_DMA == 0 && _SPI2_ENABLE) || (_SPI3_USE_DMA == 0 && _SPI3_ENABLE)
                                NVIC_DisableIRQ(SPI_cfg[hdl->major].IRQn);
                                #endif
                        }
                }

                /* free module memory if all devices are deinitialized */
                bool free_module_mem = true;
                for (int i = 0; i < _NUMBER_OF_SPI_PERIPHERALS && free_module_mem; i++) {
                        free_module_mem = SPIM->device_protect_mtx[i] == NULL;
                }

                if (free_module_mem) {
                        free(SPIM);
                        SPIM = NULL;
                }

                _sys_critical_section_end();

                /* free virtual spi memory */
                free(hdl);

                return ESUCC;
        } else {
                return EBUSY;
        }
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(SPI, void *device_handle, u32_t flags)
{
        UNUSED_ARG(flags);

        struct spi_virtual *hdl = device_handle;

        return _sys_device_lock(&hdl->file_lock) ? ESUCC : EBUSY;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(SPI, void *device_handle, bool force)
{
        struct spi_virtual *hdl = device_handle;

        if (_sys_device_is_access_granted(&hdl->file_lock) || force) {
                _sys_device_unlock(&hdl->file_lock, force);
                return ESUCC;
        } else {
                return EBUSY;
        }
}

//==============================================================================
/**
 * @brief Write data to device. Function does not check that current task is
 *        allowed to write. This is filtered by the open() function. This design
 *        helps to handle other modules that uses directly files to transfer
 *        data. This allows modules to access file from other tasks
 *        (application tasks that not opened SPI file).
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(SPI,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG(fpos);
        UNUSED_ARG(fattr);

        struct spi_virtual *hdl    = device_handle;
        int                 status = EIO;

        if (_sys_mutex_lock(SPIM->device_protect_mtx[hdl->major], MUTEX_TIMOUT)) {
                if (SPIM->RAW[hdl->major] == false) {
                        deselect_slave(hdl->major);
                        apply_SPI_config(hdl);
                        select_slave(hdl->major, hdl->minor);
                }

                if (transceive(hdl, src, NULL, count)) {
                        *wrcnt = count;
                        status = ESUCC;
                }

                _sys_mutex_unlock(SPIM->device_protect_mtx[hdl->major]);
        } else {
                status = ETIME;
        }

        return status;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(SPI,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG(fpos);
        UNUSED_ARG(fattr);

