devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        /* finish transmission if all frames are received and transmitted */
        void check_finish()
        {
                if (SPIM->count[major] == 0) {
                        if (SPIM->RAW[major] == false) {
                                deselect_slave(major);
                        }

                        CLEAR_BIT(SPI->CR2, SPI_CR2_RXNEIE);
                        CLEAR_BIT(SPI->CR2, SPI_CR2_TXEIE);
                        _sys_semaphore_signal_from_ISR(SPIM->wait_irq_sem[major], &woken);
                }
        }

        /* IRQ operations */
        transmit();
        receive();
        check_finish();

        return woken;
}
#endif

//==============================================================================
/**
 * @brief  DMA IRQ handler
 * @param  major        SPI major number
 * @return If task was woken then true is returned, otherwise false
 */
//==============================================================================
#if  (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0) || (_SPI3_USE_DMA > 0)
static bool handle_DMA_IRQ(u8_t major)
{
        u32_t DMA_IRQ_mask = (DMA_ISR_GIF1 | DMA_ISR_TCIF1 | DMA_ISR_TEIF1);
        u8_t  ch_position  = (SPI_cfg[major].DMA_Rx_channel_number - 1) * 4;
        SPI_cfg[major].DMA->IFCR = (DMA_IRQ_mask << ch_position);

        CLEAR_BIT(SPI_cfg[major].DMA_Rx_channel->CCR, DMA_CCR1_EN);
        CLEAR_BIT(SPI_cfg[major].DMA_Tx_channel->CCR, DMA_CCR1_EN);
        CLEAR_BIT(SPI_cfg[major].SPI->CR2, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);

        if (SPIM->RAW[major] == false) {
                deselect_slave(major);
        }

        bool woken = false;
        _sys_semaphore_signal_from_ISR(SPIM->wait_irq_sem[major], &woken);
        woken = woken || SPIM->count[major] > 10;

        return woken;
}
#endif

//==============================================================================
/**
 * @brief SPI1 IRQ handler
 */
//==============================================================================
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0) && (_SPI1_USE_DMA == 0)
void SPI1_IRQHandler(void)
{
        if (handle_SPI_IRQ(_SPI1)) {
                _sys_task_yield_from_ISR();
        }
}
#endif

//==============================================================================
/**
 * @brief SPI2 IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0) && (_SPI2_USE_DMA == 0)
void SPI2_IRQHandler(void)
{
        if (handle_SPI_IRQ(_SPI2)) {
                _sys_task_yield_from_ISR();
        }
}
#endif

//==============================================================================
/**
 * @brief SPI3 IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0) && (_SPI3_USE_DMA == 0)
void SPI3_IRQHandler(void)
{
        if (handle_SPI_IRQ(_SPI3)) {
                _sys_task_yield_from_ISR();
        }
}
#endif

//==============================================================================
/**
 * @brief DMA Rx transfer complete IRQ for SPI1
 */
//==============================================================================
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0) && (_SPI1_USE_DMA > 0)
void DMA1_Channel2_IRQHandler(void)
{
        if (handle_DMA_IRQ(_SPI1)) {
                _sys_task_yield_from_ISR();
        }
}
#endif

//==============================================================================
/**
 * @brief DMA Rx transfer complete IRQ for SPI2
 */
//==============================================================================
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0) && (_SPI2_USE_DMA > 0)
void DMA1_Channel4_IRQHandler(void)
{
        if (handle_DMA_IRQ(_SPI2)) {
                _sys_task_yield_from_ISR();
        }
}
#endif

//==============================================================================
/**
 * @brief DMA Rx transfer complete IRQ for SPI3
 */
//==============================================================================
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0) && (_SPI3_USE_DMA > 0)
void DMA2_Channel1_IRQHandler(void)
{
        if (handle_DMA_IRQ(_SPI3)) {
                _sys_task_yield_from_ISR();
        }
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
